{
  "3.11.5": {
  "description": "<ul><li>Updates embedded Twig to v1.42.5 to address PHP7.4 compatibility issues and to match the version of Twig used by our Drupal sites</li></ul>",
  "requires": "",
  "tested": "5.3.2",
  "upgrade_notice": ""
},
  "3.11.4": {
    "description": "<ul><li>Removes call to deprecated function each from template-locator</li><li>Fixes issue null post TemplateInjector when viewing 404 request</li></ul>",
    "requires": "",
    "tested": "5.3.2",
    "upgrade_notice": ""
  },
  "3.10.1": {
    "description": "<ul><li>Removes deprecated each() function from Loader.php</li><li>Checks view name passed to render() to ensure it isn't empty.</li></ul>",
    "requires": "",
    "tested": "5.3.2",
    "upgrade_notice": ""
  },
  "3.10.0": {
    "description": "<ul><li> Changes <code>.items</code> property of SingleMenu model to be a nested array of Menu item objects to match the nested structure of the actual menu</li><li>The previous <code>.items</code> property that was a flattened list of menu items is now <code>.menu_items</code></li><li>Adds filter <code>mizzoumvc_menu_item</code> that fires right before a menu item is saved in the <code>.items</code> list. Calling function is passed a WP_Post (Menu Item) object, and expects the same returned</li><li>Adds Twig namespaces to all template directory locations. Default namespaces are <code>@child</code> (if applicable), <code>@parent</code>, <code>@mizzoumvc</code></li><li>Adds filter <code>mizzoumvc_view_paths</code> that allows for altering the list of template directory paths given to the View Engine. Calling function is passed an associative array of namespace=>path template locations, expects an associative array to be returned</li></ul>",
    "requires": "4.7.0",
    "tested": "5.2.3",
    "upgrade_notice": "This is a non-breaking update. Please see readme.txt for full update."
  },
  "3.9.1": {
    "description": "Corrects version number in WordPress Plugin metadata",
    "requires": "4.7.0",
    "tested": "5.2.3",
    "upgrade_notice": "This is a non-breaking update. HOWEVER, if you are updating from v3.8.3 or earlier, please see the changelog notes for 3.9.0 "
  },
  "3.9.0": {
    "description": "Updates twig library to 1.42.2",
    "requires": "4.7.0",
    "tested": "5.2.3",
    "upgrade_notice": "This should be a non-breaking change. However, *please* test before moving to production as the jump in Twig version was fairly substantial."
  },
  "3.8.3": {
    "description": "Removes the composer constraint on Twig in composer.json that was preventing other packages from updating.",
    "requires":"4.7.0",
    "tested":"5.2.2",
    "upgrade_notice": "This is a non-critical bug fix that only affects sites using a composer-based worfkflow. Update at your convenience."
  },
  "3.8.2": {
    "description": "Fixes situation where certain files were formatted with Windows line endings, which broke the ability to find namespaces.",
    "requires":"4.7.0",
    "tested":"5.2.2",
    "upgrade_notice": "This is a non-critical bug fix that only affects a limited number of users. Update at your convenience."
  },
  "3.8.0": {
    "description": "Added composer.json description so plugin is now installable via composer. Added WPCLI command `wp mizzoumvc clear-cache` to manually clear Twig cache files.",
    "requires": "4.7.0",
    "tested": "5.1.1",
    "upgrade_notice": "This is a non-critical update. Update at your convenience."
  },
  "3.7.2": {
    "description": "Fixes Breadcrumbs not working correctly when enabled at a global level",
    "requires": "4.7.0",
    "tested": "4.9.8",
    "upgrade_notice": "This is a non-critical update. Update at your convenience."
  },
  "3.7.1": {
    "description": "Future compatibility update with changes to baseView. Currently experimenting with adding more content blocks into the baseView. This update allows for those upcoming change.",
    "requires": "4.7.0",
    "tested": "4.9.8",
    "upgrade_notice": "This is a non-critical update. Update at your convenience."
  }
}